/* In browser window title */
"Get a donation key!" = "Get a donation key!";

/* The full name of the supporter */
"Registered to {0}" = "Rekisteröity {0}:lle";

/* Cyberduck is open source software */
"Thanks for your support! Your contribution helps to further advance development to make Cyberduck even better." = "Kiitos tuestasi! Lahjoituksesi auttaa kehittämään Cyberduckista vielä paremman.";

/* Copy of donation key */
"Your donation key has been copied to the Application Support folder." = "Lahjoitusavaimesei on kopioitu Application Support-kansioon.";

/* Validation failed */
"Not a valid donation key" = "Kelvoton lahjoitusavain";

"This donation key does not appear to be valid." = "Tämä lahjoitusavain ei näytä olevan kelvollinen.";

/* Thank you */
"Continue" = "Jatka";